<a href="https://colab.research.google.com/github/georgeray1999-CS/Colab-Practice/blob/main/Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!git clone https://github.com/awesomedata/awesome-public-datasets.git

Cloning into 'awesome-public-datasets'...
remote: Enumerating objects: 1968, done.
remote: Total 1968 (delta 0), reused 0 (delta 0), pack-reused 1968
Receiving objects: 100% (1968/1968), 802.64 KiB | 15.43 MiB/s, done.
Resolving deltas: 100% (1189/1189), done.

In [ ]:
# unzip data
from zipfile import ZipFile

file_name = "awesome-public-datasets/Datasets/titanic.csv.zip"
with ZipFile(file_name, 'r') as zip:
  zip.extractall()
  print("done")

done

In [ ]:
import pandas as pd

df = pd.read_csv("titanic.csv")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]